<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"           "http://www.w3.org/TR/REC-html40/loose.dtd"><html>	<head>		<title>EV Nova Bible - D&uuml;de</title>		<link rel="stylesheet" href="styles.css">	</head>	<body bgcolor="#000000" text="#DDDDDD"><table width="86%" align="center">	<tr>		<td align="left" width="200"><a href="desc.html"><b>&lt;&lt;</b> D&euml;sc</a>		<td align="center"><a href="contents.html"><b>Table of Contents</b></a>		<td align="right" width="200"><a href="flet.html">Fl&euml;t <b>&gt;&gt;</b></a>	</tr></table><br><div class="enclose"><p class="huge" align="center">D&uuml;de Resource</p><div class="hr" align="center"></div><p>&nbsp;</p><blockquote><p>A d&uuml;de resource can be thought of as a container for ships that sharecertain characteristics. Any <a href="ship.html">sh&iuml;p</a> of a given d&uuml;de class will have that dudeclass's AI type and governmental affiliation, and will yield the same types ofbooty when boarded. In a d&uuml;de resource, up to 16 different <a href="ship.html">sh&iuml;p</a> classes can bepointed to, with a probability set for each <a href="ship.html">sh&iuml;p</a> class. The result of all thisis that, in other parts of Nova's data file, you can point to a d&uuml;de class andknow that Nova will create a <a href="ship.html">sh&iuml;p</a> of the proper AI type and governmentalalignment, and will pick the new ship's type based on the probabilities you setin the d&uuml;de resource. The d&uuml;de resource's fields are:</p><table><tr valign="top"><td class="colone">AIType             <td>Which type of AI to use for ships of this d&uuml;de class (see                     below).  If you set this to 0, each <a href="ship.html">sh&iuml;p</a> will use its own                     inherent AI type.<tr valign="top"><td class="colone"><a href="govt.html">G&ouml;vt</a>               <td>The ID number of the d&uuml;de class's government, or -1 for                     independent.<tr valign="top"><td class="colone">Booty              <td>Flags that define what you'll get when you board a <a href="ship.html">sh&iuml;p</a> of                     this d&uuml;de class. (see below)<tr valign="top"><td class="colone">InfoTypes          <td>What kind of info to display when hailed<br>                   <span class="hex">0x1000</span> - Good prices<br>                   <span class="hex">0x2000</span> - Disaster info<br>                   <span class="hex">0x4xxx</span> - Specific advice (the lower 12 bits of this                                               value are added to 7500 to get                                               the ID of the STR# resource                                               from which to get the quote)<br>                   <span class="hex">0x8000</span> - Generic <a href="govt.html">g&ouml;vt</a> hail messages                                             <tr valign="top"><td class="colone">Flags              <td><span class="hex">0x0001</span> - Carries food when plundered<br>                   <span class="hex">0x0002</span> - Carries industrial goods<br>                   <span class="hex">0x0004</span> - Carries medical supplies<br>                   <span class="hex">0x0008</span> - Carries luxury goods<br>                   <span class="hex">0x0010</span> - Carries metal<br>                   <span class="hex">0x0020</span> - Carries equipment<br>                   <span class="hex">0x0040</span> - Carries money (amount depends on the ship's                               purchase price)<br>                   <span class="hex">0x0100</span> - Ships of this d&uuml;de type can't be hit by the                               player and their shots can't hit the player                               (useful for things like AuxShip mission                               escorts, etc.)<tr valign="top"><td class="colone">ShipType (x16)     <td>These fields contain the ID numbers of up to 16 different                     <a href="ship.html">sh&iuml;p</a> classes. Set to 0 or -1 if unused.                     <tr valign="top"><td class="colone">Probability (x16)  <td>These fields set the probability that a <a href="ship.html">sh&iuml;p</a> of this dude                     class will be of a certain <a href="ship.html">sh&iuml;p</a> type</table><p>The four different AI types are:</p><table><tr valign="top"><td class="colone">1 - Wimpy Trader     <td>Visits planets and runs away when attacked<tr valign="top"><td class="colone">2 - Brave Trader     <td>Visits planets and fights back when attacked, but runs                       away when his attacker is out of range<tr valign="top"><td class="colone">3 - Warship          <td>Seeks out and attacks his enemies, or jumps out if there                       aren't any.<tr valign="top"><td class="colone">4 - Interceptor      <td>Seeks out his enemies, or parks in orbit around a planet                       if he can't find any. Buzzes incoming ships to scan them                       for illegal cargo. Also acts as "piracy police" by                       attacking any <a href="ship.html">sh&iuml;p</a> that fires on or attempts to board                       another, non-enemy <a href="ship.html">sh&iuml;p</a> while the interceptor is                       watching.</table><p>You can set different combinations of booty to be had from ships of a certaind&uuml;de class by ORing different bits into the dude's Booty field. If a d&uuml;de classhas a booty flag of 0x0000, then you can't get anything from the <a href="ship.html">sh&iuml;p</a>, andyou're told that you were "repelled while attempting to board" it. The differentbooty flags are documented above</p><p>Unlike previous versions of the EV engine, Nova can handle d&uuml;de resources thatare not completely filled - so, while the d&uuml;de resource can handle references toas many as 16 different <a href="ship.html">sh&iuml;p</a> types, not all fields have to be used. If you dothis, remember to set the corresponding ShipType fields to 0 or -1 to indicatethat they're unused.</p></blockquote><p>&nbsp;</p><p>&nbsp;</p></div><br><table width="86%" align="center">	<tr>		<td align="left" width="200"><a href="desc.html"><b>&lt;&lt;</b> D&euml;sc</a>		<td align="center"><a href="contents.html"><b>Table of Contents</b></a>		<td align="right" width="200"><a href="flet.html">Fl&euml;t <b>&gt;&gt;</b></a>	</tr></table><p align="center">(&copy;) 2000-2002 by Matt Burch and Ambrosia Software, Inc.</p>	</head></html>