<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"           "http://www.w3.org/TR/REC-html40/loose.dtd"><html>	<head>		<title>EV Nova Bible - R&auml;nk</title>		<link rel="stylesheet" href="styles.css">	</head>	<body bgcolor="#000000" text="#DDDDDD"><table width="86%" align="center">	<tr>		<td align="left" width="200"><a href="pers.html"><b>&lt;&lt;</b> P&euml;rs</a>		<td align="center"><a href="contents.html"><b>Table of Contents</b></a>		<td align="right" width="200"><a href="roid.html">R&ouml;id <b>&gt;&gt;</b></a>	</tr></table><br><div class="enclose"><p class="huge" align="center">R&auml;nk Resource</p><div class="hr" align="center"></div><p>&nbsp;</p><blockquote><p>The r&auml;nk resource is used to give the player a feeling of 'belonging' to agiven government. It can also be used to give the player certain advantages thatcome with r&auml;nk. When a r&auml;nk is made active (which is accomplished through anysuitable control bit set string) the player is given all the privileges of thatr&auml;nk, whatever they might be, and the name of that r&auml;nk is displayed in theplayer-info dialog.</p><table><tr valign="top"><td class="colone">Weight       <td>The importance of this r&auml;nk, relative to the other r&auml;nk resources              that might be active. Ranks with higher weight are displayed              first in the player-info dialog, and the active r&auml;nk with the              highest weight is selected for the &lt;PRK&gt; and &lt;PSR&gt; mission              briefing tags.<tr valign="top"><td class="colone">AffilGovt    <td>The ID of the government affiliated with this r&auml;nk. <tr valign="top"><td class="colone">Contribute   <td>Another 64 bits of Contribute values that kick in when the rank              is active. These can be used to prevent the player from buying              certain items or doing certain missions until achieving a certain              r&auml;nk, for example.<tr valign="top"><td class="colone">Salary       <td>The number of credits that the affiliated government will pay             the player, per day<tr valign="top"><td class="colone">SalaryCap    <td>The maximum amount of money the player can have before the             affiliated government stops paying the salary. Set to 0 or -1 if             unused.<tr valign="top"><td class="colone">Flags        <td><span class="hex">0x0001</span> - Deactivate all other active ranks affiliated with this                       same <a href="govt.html">g&ouml;vt</a> when this r&auml;nk is activated (excludes                       permanent ranks)<br>             <span class="hex">0x0002</span> - Deactivate all other active ranks affiliated with this                       same <a href="govt.html">g&ouml;vt</a> when this r&auml;nk is deactivated (excludes                       permanent ranks)<br>             <span class="hex">0x0004</span> - Deactivate this r&auml;nk if player destroys or disables a                       <a href="ship.html">sh&iuml;p</a> of the affiliated government or its allies<br>             <span class="hex">0x0008</span> - R&auml;nk is permanent and cannot be deactivated except if                       explicitly done by a control bit eval string<br>             <span class="hex">0x0010</span> - Deactivate all other active and lower-weighted ranks                       affiliated with this same <a href="govt.html">g&ouml;vt</a> when this r&auml;nk is                       activated (excludes permanent ranks)<br>             <span class="hex">0x0020</span> - Deactivate all other active and lower-weighted ranks                       affiliated with this same <a href="govt.html">g&ouml;vt</a> when this r&auml;nk is                       deactivated (excludes permanent ranks)<br>             <span class="hex">0x0040</span> - Deactivate this r&auml;nk if the player commits any crime                       against the affiliated government<br>             <span class="hex">0x0100</span> - Ships of the affiliated government will not automatically                       attack the player when he has this rank<br>             <span class="hex">0x0200</span> - All planets of the affiliated government will let the                       player land when he has this r&auml;nk, regardless of their                       MinStatus field<br>             <span class="hex">0x0400</span> - Player can always request battle assistance from ships of                       the affiliated government, who will also call in                       reinforcements on the player's behalf if they are                       available.<br>             <span class="hex">0x0800</span> - Ships allied with the affiliated <a href="govt.html">g&ouml;vt</a> will always repair                       or refuel the player for free.<tr valign="top"><td class="colone">PriceMod     <td>Used to modify the prices of items and ships at planets owned by              the affiliated government. A value of 100 equals 100% of original              price (i.e. prices are unchanged). Higher or lower  values raise              or lower the prices correspondingly.  (can be used to let              distinguished players get special deals on ships and items at              "friendly" planets that have granted them the rank)</table><p>The name of the r&auml;nk resource is the full name of the r&auml;nk, displayed in theplayer-info dialog.</p><p><b>example: "Commission of Space Marshall in the Hector Empire"</b></p><p>The text fields in the r&auml;nk resource are:</p><table><tr valign="top"><td class="colone">ConvName     <td>The r&auml;nk name as used in conversation, through mission briefings              and the &lt;PRK&gt; tag. If this is set to an empty string, the rank              will never be used in conversation. If there are no active ranks              or none of the active ranks have ConvNames, the &lt;PRK&gt; tag will              simply display "captain".   example: if ConvName is "Space              Marshall", then "Good job, &lt;PRK&gt;" becomes either "Good job,              Space Marshall" or "Good job, captain".<tr valign="top"><td class="colone">ShortName    <td>The short r&auml;nk named as used in conversation through mission              briefings and the &lt;PSR&gt; tag. Behavior with an empty string is the              same as for the ConvName field.  example: if ShortName is              "Marshall" then "Hi there, &lt;PSR&gt;" becomes either "Hi there,              Marshall" or "Hi there, captain".</table></blockquote><p>&nbsp;</p><p>&nbsp;</p></div><br><table width="86%" align="center">	<tr>		<td align="left" width="200"><a href="pers.html"><b>&lt;&lt;</b> P&euml;rs</a>		<td align="center"><a href="contents.html"><b>Table of Contents</b></a>		<td align="right" width="200"><a href="roid.html">R&ouml;id <b>&gt;&gt;</b></a>	</tr></table><p align="center">(&copy;) 2000-2002 by Matt Burch and Ambrosia Software, Inc.</p>	</head></html>