<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"           "http://www.w3.org/TR/REC-html40/loose.dtd"><html>	<head>		<title>EV Nova Bible - Sh&iuml;p</title>		<link rel="stylesheet" href="styles.css">	</head>	<body bgcolor="#000000" text="#DDDDDD"><table width="86%" align="center">	<tr>		<td align="left" width="200"><a href="roid.html"><b>&lt;&lt;</b> R&ouml;id</a>		<td align="center"><a href="contents.html"><b>Table of Contents</b></a>		<td align="right" width="200"><a href="spob.html">Sp&ouml;b <b>&gt;&gt;</b></a>	</tr></table><br><div class="enclose"><p class="huge" align="center">Sh&iuml;p Resource</p><div class="hr" align="center"></div><p>&nbsp;</p><blockquote><p>Spaceships are the heart of Nova, so the sh&iuml;p resource contains a lot ofinfo. The name of a sh&iuml;p class, which is seen in the targeting display,corresponds to the name of the sh&iuml;p resource. The first nine fields give Novasome general performance info on each sh&iuml;p type:</p><table><tr valign="top"><td class="colone">Holds             <td>Cargo capacity, in tons. Put a negative sign in front of this                    value if you want to prevent the player from purchasing                    mass expansions. (e.g. a value of -100 would mean 100 tons                    of hold space but no mass expansions allowed)<tr valign="top"><td class="colone">Shield            <td>Shield strength.<tr valign="top"><td class="colone">Accel             <td>Acceleration magnitude. 300 is considered an average value.<tr valign="top"><td class="colone">Speed             <td>Top speed. 300 is also an average value here.<tr valign="top"><td class="colone">Maneuver          <td>Turn rate. 10 = 30&deg;/sec.<tr valign="top"><td class="colone">Fuel              <td>Fuel capacity. 100 = 1 jump.<tr valign="top"><td class="colone">FreeMass          <td>Space available to add additional items and upgrades. Note                    that this is in addition to the space taken up by the                    sh&iuml;p's stock weapons. (e.g. a sh&iuml;p with 20 tons listed in                    FreeMass and 10 tons of stock weapons will actually have 30                    tons of expansion space, with 20 available.)<tr valign="top"><td class="colone">Armor             <td>Armor strength.<tr valign="top"><td class="colone">ShieldRech        <td>Shield recharge speed, in number of shield points x1000 per                    frame. Bigger numbers here mean faster recharge - a value                    of 1000 is equal to 1 point per frame or 30 points per                    second.</table><p>The next twelve fields tell Nova which stock weapons to put on your sh&iuml;p whenyou first buy it:</p><table><tr valign="top"><td class="colone">WeapType (x8)     <td>ID numbers of weapon types<br>                  -1 or 0     No weapon<br>                  128-191     Add this weapon type<tr valign="top"><td class="colone">WeapCount (x8)    <td>How many of each of the above weapons to add<br>                  -1 or 0     None<br>                   1 and up   Add this many<tr valign="top"><td class="colone">AmmoLoad (x8)     <td>The standard ammo load for weapons that need it, or ignored                    for those that don't<br>                  -1 or 0     No ammo<br>                   1 and up   Include this many rounds of ammo</table><p>The next two fields tell Nova what this sh&iuml;p's maximum loadout of fixed guns andturreted weapons is. Each sh&iuml;p has an inherent upper limit on fixed guns andturrets, in order to keep them from becoming absurdly powerful. (e.g. a bulkfreighter has lots of room to add weapons, but is limited to a single turret fordefense) The fields are:</p><table><tr valign="top"><td class="colone">MaxGun     <td>The sh&iuml;p's maximum number of fixed guns, which are flagged in the             WeapFlag field of the <a href="outf.html">o&uuml;tf</a> resource.<tr valign="top"><td class="colone">MaxTur     <td>The sh&iuml;p's maximum number of turrets, which are flagged in the             WeapFlag field of the <a href="outf.html">o&uuml;tf</a> resource.</table><p>The next field tells Nova where this sh&iuml;p is available for purchase:</p><table><tr valign="top"><td class="colone">TechLevel     <td>What the technology level of the sh&iuml;p is. This sh&iuml;p will be                available at all shipyards with a tech level of this value or                higher. (The exception to this rule involves the SpecialTech                fields of the <a href="spob.html">sp&ouml;b</a> resource; see the section on <a href="spob.html">sp&ouml;b</a> resources                for more information.)</table><p>The next field, Cost, tells Nova how much to charge you when you buy this sh&iuml;p.The cost of buying a sh&iuml;p is always the cost of the new sh&iuml;p minus 25% of theoriginal cost of your current sh&iuml;p and upgrades. (i.e. you always "trade up" toa new sh&iuml;p)</p><p>The next field stores info on how the sh&iuml;p explodes:</p><table><tr valign="top"><td class="colone">DeathDelay      <td>The number of frames the sh&iuml;p "disintegrates" before finally                  exploding.<br>      <b>0-59</b> - The sh&iuml;p disintegrates for this number of frames and then                  disappears in a single fireball.<br>      <b>60+</b> - The sh&iuml;p disintegrates for this number of frames and then                  disappears in a huge explosion. The exact size of the                  resulting fireball is proportional to the sh&iuml;p's mass. (see                  below)<tr valign="top"><td class="colone">ArmorRech       <td>Armor recharge speed, in number of armor points x1000 per                    frame. Bigger numbers here mean faster recharge - a value                    of 1000 is equal to 1 point per frame or 30 points per                    second.<tr valign="top"><td class="colone">Explode1       <td>Type of explosion to show (0-63) while the sh&iuml;p is breaking up,                 or -1 to not show any explosions until the sh&iuml;p is finished                 being destroyed.                 <tr valign="top"><td class="colone">Explode2       <td>Type of explosion to show (0-63) when the sh&iuml;p is completely                 destroyed. You can also add 1000 to the value of this field in                 the same manner as the ExplodeType field in the <a href="weap.html">w&euml;ap</a> resource.                 Set to -1 to not show any explosion when the sh&iuml;p is                 destroyed.<tr valign="top"><td class="colone">DispWeight     <td>The display weight of this sh&iuml;p type. Sh&iuml;ps with a higher                 display weight are shown closer to the top of the shipyard                 dialog. This can be used to effectively rearrange the order                 in which sh&iuml;ps are displayed without rearranging the                 resources themselves.<tr valign="top"><td class="colone">Mass           <td>The mass of the sh&iuml;p, in tons. This doesn't affect acceleration                 or speed at all, but it does affect travel time in hyperspace                 and the display on the density scanner. Also, the blast radius                 and impact strength when the sh&iuml;p explodes is proportional to                 its mass.<br>  <b>1-99</b> - 1 day per jump, small blip on density scanner<br>  <b>100-199</b> - 2 days per jump, large blip on density scanner<br>  <b>200 and up</b> - 3 days per jump, large blip on density scanner<tr valign="top"><td class="colone">Length     <td>The sh&iuml;p's length in meters. Currently unused in any calculations,             but it's kinda cool, so it's displayed in the "detailed sh&iuml;p info"             dialog.</table><p>The next field tells Nova what kind of AI the sh&iuml;p will have if it's not createdin connection with a <a href="dude.html">d&uuml;de</a> resource. The only place this field is useful is whena sh&iuml;p is created as an escort sh&iuml;p; otherwise, it's ignored:</p><table><tr valign="top"><td class="colone">InherentAI     <td>What AI the sh&iuml;p uses when it's escorting the player.<br>       <b>1-4</b> - Use this kind of AI. (see the AI descriptions above)<tr valign="top"><td class="colone">Crew           <td>Number of crew members. Sh&iuml;ps with 0 crew can't be boarded,                 nor can they capture any other sh&iuml;ps.<tr valign="top"><td class="colone">Strength       <td>An arbitrary value that represents the relative strength of                 the sh&iuml;p type with respect to the rest of the universe.                 Used when calculating combat odds (see the <a href="govt.html">g&ouml;vt</a> resource                 for details).</table><p>The next field tells Nova what government is associated with a sh&iuml;p type.Note that unlike previous EV games, Nova actually handles two inherentgovernment associations for each sh&iuml;p type: an inherent combat govt(used when an AI sh&iuml;p or stellar is deciding if it likes or hates anothersh&iuml;p) and an inherent attributes <a href="govt.html">g&ouml;vt</a> (used for non-combat things likevoice type, distress message flags, etc). Sometimes you might want tocreate a sh&iuml;p type that inherits attributes from a particular <a href="govt.html">g&ouml;vt</a> butisn't considered to be inherently of that <a href="govt.html">g&ouml;vt</a> in combat, so Nova letsyou use the InherentGovt field in several different ways:</p><table><tr valign="top"><td class="colone">InherentGovt     <td><b>-1</b> - No inherent combat <a href="govt.html">g&ouml;vt</a> or inherent attributes                              <a href="govt.html">g&ouml;vt</a> for this sh&iuml;p<br>                 <b>128-383</b> - Sh&iuml;p is treated as being inherently of the                              <a href="govt.html">g&ouml;vt</a> with this ID, both for AI combat                              and attributes inheritance)<br>                 <b>1128-1383</b> - Sh&iuml;p has an inherent attributes <a href="govt.html">g&ouml;vt</a> with                              this ID (minus 1000) but no inherent                              combat <a href="govt.html">g&ouml;vt</a>.<br>                 <b>2128-2383</b> - Sh&iuml;p has an inherent combat <a href="govt.html">g&ouml;vt</a> with                              this ID (minus 2000) but no inherent                              attributes <a href="govt.html">g&ouml;vt</a>.</table><p>The next field is for some miscellaneous flags:</p><table><tr valign="top"><td class="colone">Flags        <td><span class="hex">0x0001</span> - Slow jumping (75% normal speed)<br>             <span class="hex">0x0002</span> - Semi-fast jumping (125%)<br>             <span class="hex">0x0004</span> - Fast jumping (150%)<br>             <span class="hex">0x0008</span> - Player sh&iuml;p takes advantage of FuelRegen property<br>             <span class="hex">0x0010</span> - Sh&iuml;p is disabled at 10% armor instead of 33%<br>             <span class="hex">0x0020</span> - Sh&iuml;p has afterburner when player has an advanced combat                           rating<br>             <span class="hex">0x0040</span> - Sh&iuml;p always has afterburner (for AIs only)<br>             <span class="hex">0x0100</span> - Show % armor on target display instead of "Shields                          Down"<br>             <span class="hex">0x0200</span> - Don't show armor or shield state on status display<br>             <span class="hex">0x0400</span> - Sh&iuml;p is a planet-type sh&iuml;p, and can only be hit by                          planet-type weapons<br>             <span class="hex">0x1000</span> - Sh&iuml;p's turrets have a blind spot to the front<br>             <span class="hex">0x2000</span> - Sh&iuml;p's turrets have a blind spot to the sides<br>             <span class="hex">0x4000</span> - Sh&iuml;p's turrets have a blind spot to the rear<br>             <span class="hex">0x8000</span> - Sh&iuml;p is an escape sh&iuml;p type - if the player is carrying                          any sh&iuml;ps of this type and decides to eject, he will                          fly off in a sh&iuml;p of this type (with random damage)                          instead of an escape pod.<tr valign="top"><td class="colone">PodCount     <td>For decorative purposes, AI sh&iuml;ps can be made to launch escape             pods when they're destroyed. This field contains the standard             number of escape pods for an AI sh&iuml;p of this type to launch when             destroyed, at a rate of one per second. Note that this has nothing             to do with the <a href="pers.html">p&euml;rs</a> field's escape pod flag, it's just for eye             candy. Don't overuse this field, as it can be annoying if used             too often. (perhaps restrict it only to luxury liner type sh&iuml;ps).<tr valign="top"><td class="colone">DefaultItems   <td>Up to eight default items with which to equip this sh&iuml;p when the                 player buys or captures one. Note that AI-controlled sh&iuml;ps                 will ignore these fields; also, don't put anything in here                 that isn't a physical item - i.e. afterburners, shield                 boosters, and the like are okay, but no fake IDs, maps, etc.<br>               <b>128-255</b> - Sh&iuml;p comes stock with this item<br>               <b>-1</b> - Ignored<tr valign="top"><td class="colone">ItemCount      <td>The number of each DefaultItem with which to equip the player.<tr valign="top"><td class="colone">FuelRegen      <td>This sh&iuml;p type's inherent fuel regeneration property. Works                 exactly the same as the fuel scoop ModVal property - useful                 for making sh&iuml;ps with built-in fuel replenishment. Note that                 for the player to be able to use this field, the 0x0008 flag                 must also be set. (this allows you to give enemy sh&iuml;ps                 built-in fuel scoops but still make the player have to buy his                 own)<tr valign="top"><td class="colone">SkillVar       <td>The amount (in percent) to which this sh&iuml;p's pilots' skill                 varies. This affects acceleration and turn rate for each sh&iuml;p:                 i.e. a skill variance of 10% would make each sh&iuml;p of a given                 type up to 10% slower or faster than "stock". Values from                 1 to 50% are valid.                           <tr valign="top"><td class="colone">Flags2         <td><span class="hex">0x0001</span> - Sh&iuml;p exhibits swarming behavior<br>               <span class="hex">0x0002</span> - Sh&iuml;p prefers standoff attacks<br>               <span class="hex">0x0004</span> - Sh&iuml;p can't be targeted<br>               <span class="hex">0x0008</span> - Sh&iuml;p can be fired on by point defense systems<br>               <span class="hex">0x0010</span> - Don't use fighter voices<br>               <span class="hex">0x0020</span> - Sh&iuml;p can jump without slowing down<br>               <span class="hex">0x0040</span> - Sh&iuml;p is inertialess<br>               <span class="hex">0x0080</span> - AI sh&iuml;ps of this type will run away/dock if out of                           ammo for all ammo-using weapons<br>               <span class="hex">0x0100</span> - AI sh&iuml;ps of this type will cloak when their weapon                           goes into burst reload<br>               <span class="hex">0x0200</span> - AI sh&iuml;ps will cloak when running away<br>               <span class="hex">0x0400</span> - AI sh&iuml;ps will cloak when hyperspacing<br>               <span class="hex">0x0800</span> - AI sh&iuml;ps will cloak when just flying around<br>               <span class="hex">0x1000</span> - AI sh&iuml;ps will not uncloak until close to their target<br>               <span class="hex">0x2000</span> - AI sh&iuml;ps will cloak when docking<br>               <span class="hex">0x4000</span> - AI sh&iuml;ps will cloak when preemptively attacked <tr valign="top"><td class="colone">Availability   <td>Control bit test expression. The player will be able to purchase               this type of sh&iuml;p when the expression evaluates to true. Leave               blank if unused. Depending on the configuration of other flags,               the sh&iuml;p might appear in the shipyard but not be able to be               purchased if its Availability evaluates to false. <tr valign="top"><td class="colone">AppearOn       <td>Control bit test expression. Sh&iuml;ps of this type will not show up               in <a href="dude.html">d&uuml;de</a> resources if this expression evaluates to false. Leave               blank if unused.               <tr valign="top"><td class="colone">OnPurchase     <td>Control bit set expression. Leave blank if unused. <tr valign="top"><td class="colone">Deionize       <td>The rate at which this sh&iuml;p type dissipates ionization charge.               A value of 100 equals 1 point of ion energy per 1/30th of a               second. Higher values for Deionize yield faster ion charge               dissipation.               <tr valign="top"><td class="colone">IonizeMax      <td>The amount of ion charge at which a sh&iuml;p of this type will be               considered "fully ionized".               <tr valign="top"><td class="colone">KeyCarried     <td>The key carried sh&iuml;p type, used for interesting effects in                the <a href="weap.html">w&euml;ap</a> and shaeauml;n resources.<tr valign="top"><td class="colone">DefaultItms2<br>ItemCount   <td>More default items, used as above<tr valign="top"><td class="colone">Contribute<br>Contribute      <td>These two Contribute fields together form a 64-bit flag that is      subsequently combined with the Contribute fields from the                outfit items in the player's possession, to be used with the                Require fields in the <a href="outf.html">o&uuml;tf</a> and <a href="misn.html">m&iuml;sn</a> resources.<tr valign="top"><td class="colone">Require<br>Require        <td>These two Require fields together form a 64-bit flag that is         logically and'ed with the Contribute fields from the player's                current sh&iuml;p and outfit items. If for each 1 bit in the Require                fields there is a matching 1 bit in one or more of the                Contribute fields, the sh&iuml;p can be purchased. Leave these                set to zero if unused. Depending on the configuration of other                flags, the sh&iuml;p might appear in the shipyard but not be able to                be purchased if the player doesn't meet the Requirements.<tr valign="top"><td class="colone">BuyRandom      <td>The percent chance that a sh&iuml;p of this type will be available for                 purchase on a given day. A BuyRandom of 0 means this sh&iuml;p will                 never be made available for purchase.<tr valign="top"><td class="colone">HireRandom     <td>The percent chance that a sh&iuml;p of this type will be available for                 hire in the bar on a given day. A HireRandom of 0 means this                 sh&iuml;p will never be made available for hire.<tr valign="top"><td class="colone">OnCapture      <td>Control bit set expression, evaluated when you capture a sh&iuml;p of                 this type. Leave blank if unused. <tr valign="top"><td class="colone">OnRetire       <td>Control bit set expression, evaluated when you sell a sh&iuml;p of                 this type and/or replace it with a captured sh&iuml;p.<tr valign="top"><td class="colone">Subtitle       <td>The subtitle to show on the target display for this sh&iuml;p type<tr valign="top"><td class="colone">Flags3         <td>Even more flags!<br>               <span class="hex">0x0001</span> - Sh&iuml;p destroys asteroids<br>               <span class="hex">0x0002</span> - Sh&iuml;p scoops asteroid debris<br>               <span class="hex">0x0010</span> - Sh&iuml;p ignores gravity<br>               <span class="hex">0x0020</span> - Sh&iuml;p ignores deadly stellars<br>               <span class="hex">0x0040</span> - Sh&iuml;p's turreted shots appear above the sh&iuml;p instead                          of below<br>               <span class="hex">0x0100</span> - Don't show sh&iuml;p in shipyard if Availability is false<br>               <span class="hex">0x0200</span> - Don't show sh&iuml;p in shipyard if Require bits not met<br>               <span class="hex">0x4000</span> - When this sh&iuml;p is available for sale, it prevents all                          higher-numbered sh&iuml;p types with equal DispWeight from                          being made available for sale at the same time.<tr valign="top"><td class="colone">UpgradeTo      <td>If an escort sh&iuml;p of this type can be upgraded, this field holds                the ID of the sh&iuml;p type that it can be upgraded to. Set to 0 or                -1 if this sh&iuml;p class can't be upgraded.                <tr valign="top"><td class="colone">EscUpgrdCost   <td>The cost to upgrade an escort sh&iuml;p of this type to the next more                advanced version, as defined in the UpgradeTo field.<tr valign="top"><td class="colone">EscSellValue   <td>The amount of cash the player gets for selling off a captured                escort of this type. If you input a number that's less than or                equal to zero here, Nova will default to 10% of the sh&iuml;p's                original cost.<tr valign="top"><td class="colone">EscortType     <td>Tells Nova which of the four categories of escorts to put this                sh&iuml;p type into when organizing the escort control menu.<br>                <b>-1</b> - Have the game try to figure it out at runtime<br>                 <b>0</b> - Fighter<br>                 <b>1</b> - Medium Ship<br>                 <b>2</b> - Warship<br>                 <b>3</b> - Freighter<tr valign="top"><td class="colone">ShortName     <td>The short string that is displayed in the shipyard dialog menu               for this sh&iuml;p type. If you want to split this name into two               separate  lines, put the characters "\n" into the name, e.g.:               "Big Ship\n(used)". When using this, lines that start with               an alphanumeric character are drawn in white, while lines               that start with other symbols are drawn in grey.<tr valign="top"><td class="colone">CommName       <td>The short string to display for this sh&iuml;p when it is hailed by                the player.<tr valign="top"><td class="colone">Long Name      <td>The long string to display when the player purchases a sh&iuml;p of                this type or starts a new pilot.                <tr valign="top"><td class="colone">MovieFile      <td>The filename of a QuickTime movie to display in place of the                sh&iuml;p picture  in the shipyard dialog. The QuickTime movie must                reside within the Nova Files or Nova Plug-Ins folders and will                be looped continuously while the player has this sh&iuml;p type                selected.</table><p>Sh&iuml;ps' target info picts are stored in PICT resources 3000 and on. The engine issmart enough to reuse targeting picts for two sh&iuml;p classes that have the samebase sprites: all you have to do is give the first of any series ofidentical-looking sh&iuml;p types a target pict in the usual way (PICT resource ID3000 + sh&iuml;pID - 128) and the engine will use it for all higher-numbered sh&iuml;ptypes with the same base sprites.</p></blockquote><p>&nbsp;</p><p>&nbsp;</p></div><br><table width="86%" align="center">	<tr>		<td align="left" width="200"><a href="roid.html"><b>&lt;&lt;</b> R&ouml;id</a>		<td align="center"><a href="contents.html"><b>Table of Contents</b></a>		<td align="right" width="200"><a href="spob.html">Sp&ouml;b <b>&gt;&gt;</b></a>	</tr></table><p align="center">(&copy;) 2000-2002 by Matt Burch and Ambrosia Software, Inc.</p>	</head></html>